# -*- coding: utf-8 -*-

# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (Коты? Коровы? Люди? Трактор? Что придумается)

import simple_draw as sd
from functions_for_painting import painting_rainbow
from functions_for_painting import draw_the_sun

sd.resolution = (1200, 800)
sd.background_color = sd.COLOR_DARK_CYAN

painting_rainbow.painting_rainbow(y=-200, radius=1200, step=8)
draw_the_sun.draw_the_sun(y=700, beam=100)

sd.pause()
